// Числа
Число1 = 10;
Число2 = 5;
Число3 = 3;

Сумма = Число1 + Число2;
Разность = Число1 - Число2;
Произведение = Число1 * Число2;
Частное = Число1 / Число2;
ЧастноеДробное =  Число1 / Число3;
СуммаДробное =  ЧастноеДробное + ЧастноеДробное;
СуммаДробное2 = СуммаДробное + СуммаДробное;
СуммаДробное3 = СуммаДробное2 + СуммаДробное2;

Сообщить("Сумма: " + Сумма);
Сообщить("Разность: " + Разность);
Сообщить("Произведение: " + Произведение);
Сообщить("Частное: " + Частное);
Сообщить("СуммаДробное: " + СуммаДробное);
Сообщить("СуммаДробное2: " + СуммаДробное2);
Сообщить("СуммаДробное3: " + СуммаДробное3);

// Строки
Имя = "Иван";
Фамилия = "Петров";
ПолноеИмя = Имя + " " + Фамилия;

Сообщить("Имя пользователя: " + ПолноеИмя);


// Булево значение
Активен = Истина;

Если Активен Тогда
    Сообщить("Пользователь активен");
Иначе
    Сообщить("Пользователь неактивен");
КонецЕсли;


// Условие с числами
КоличествоТовара = 25;

Если КоличествоТовара >= 18 Тогда
    Сообщить("Товара достаточно");
Иначе
    Сообщить("Товара недостаточно");
КонецЕсли;


// Цикл
Для Счетчик = 1 По 5 Цикл
    Сообщить("Итерация № " + Счетчик);
КонецЦикла;


// Массив
Фрукты = Новый Массив;
Фрукты.Добавить("Яблоко");
Фрукты.Добавить("Груша");
Фрукты.Добавить("Банан");

Для Каждого Фрукт Из Фрукты Цикл
    Сообщить("Фрукт: " + Фрукт);
КонецЦикла;
